# git - системф контроля версий(кода)
# github/gitlab/bitbucket - хранилище/сайт для хранения (версий )кода

# repository/репозиторий - папка в которой git отслеживает изменения 

# git init - создания репозитория 

# git status - проврка статуса отслеживания

# git add <file_name> or . - добавления файла в список отслеживания (в staging area)


# git commit -m 'пишем что хотим написать' - создания/ фиксация версии кода с сообщением


# git remote add <variable_name>( often origin) <link to repository> - связка локального репозитория с удаленным и сохранени ссылки в переменную

# git push origin <branch_name> - отправка версии кода в удаленной репозиторий 



# BRANCH/ВЕТКА - КОПИЯ КОДА НЕЗАВИСИМАЯ ОТ ОСНОВНОЙ ВЕРСИИ КОДА  ( ЧЕРНОВИК ГРУБО ГОВОРЯ)

# git branch - вывод списка веток 
# git branch <new_branch_name> - создание новой ветки
# git checkout <branch_name> - переход на указанную ветку 

